{
  "CWPON": {
    "desc": [
      "CWPON 1, 2, 3<CR>",
      "1. Enable/Disable",
      "   a. 0 = disable water profiling. When the application requires bottom tracking only disabling profiling allows for more bottom pings per second.",
      "   b. 1 = enable water profiling."
    ]
  },
  "CWPBL": {
        "type": "float",
        "min": 0.01,
        "max": 100.0,
        "desc": [
                "CWPBL n.nn<CR>",
                "Water Profile Blank (meters).",
                "Depth to start the first measurement.  This will ignore data before this depth",
                "",
                "If you want the absolute minimum value,",
                "set the value to 0.  The blanking distance can never be 0m.  But this will use",
                "the smallest value based on the setup.",
                "To get a smaller blank, make the maximum profile range smaller.  The larger the",
                "profile range, the longer, the ADCP must transmit.  The ADCP must transmit and ",
                "receive data on the same transducer.  So you want to shorten the transmit to ",
                "receive data earlier.  The earlier we receive data, the closer to the transducer",
                " we can see which will give a smaller blank size.",
                "",
                "n.nn = 0 to 100.",
                "",
                "Sets the vertical range from the face of the transducer to the first sample of the first bin."
        ]
    },
	"CWPBS": {
		"type": "float",
        "min": 0.01,
        "max": 100.0,
		"desc": [
			"CWPBS n.nn<CR>",
			"Water Profile Bin Size (meters)",
            "(Cell Size)",
			"",
			"n.nn sets the vertical bin size."
		]
	},
    "CWPBN": {
        "desc": [
          "CWPBN n<CR> ",
          "Number of Water Profile Bins (cells).",
          "",
          "n = 0 to 200 sets the number bins that will be processed and output."
        ]
    },
    "CWPBB": {
        "type": "float",
        "min": 0,
        "max": 0,
        "desc": [
                "CWPBB 1, 2, 3, 4<CR>",
                "Water Profile Broad Band. Sets water profile coded pulse transmission and lag.",
                "",
                "1. Transmit Pulse Type and Processing",
                "   0 = Narrowband.",
                "          i. Provides long range profiles at the expense of variance.",
                "          ii. Not recommended for use with bin size less than the default bin size.",
                "   1 = Broadband.",
                "          i. Typically 15% less range than narrow band but has greatly reduced variance (depending on lag length).",
                "          ii. Used in conjunction with CWPBP for small bins.",
                "   2 = Un-coded Broadband (no ambiguity resolver).",
                "          i. Non-coded has slightly higher variance than the coded transmit without the annoying autocorrelation side peaks. Better for small bins.",
                "   3 = Broadband pulse-to-pulse (no ambiguity resolver).",
                "          i. Provides ultra low variance for small bin sizes.",
                "   4 = Non Coded Broadband pulse-to-pulse (no ambiguity resolver).",
                "          i. Provides ultra low variance for small bin sizes.",
                "   5 = Broadband with ambiguity resolver ping.",
                "          i. Used in conjunction with CWPBP averaging.",
                "   6 = Broadband pulse to pulse with pulse to pulse ambiguity resolver ping.",
                "          i. Used in conjunction with CWPAP.",
                "",
                "2. Lag length in vertical meters (m).",
                "   a. Not used with Narrowband.",
                "   b. A longer lag will have lower variance and a lower ambiguity velocity.",
                "   c. Increasing the lag length will improve the accuracy but decrease the maximum velocity that can be measured.",
                "",
                "3. Transmit Bandwidth",
                "   a. Not fully implemented",
                "",
                "4. Receive Bandwidth",
                "   a. Not fully implemented"
        ]
    },
    "CWPP": {
        "desc": [
          "CWPP n<CR>",
          "Number of Water Profile Pings to average together.",
          "Overall average time = CWPP * CWPTBP",
          "This overall average time should be less then CEI.",
          "",
          "n = 0 to 10,000 sets the number of pings that will be averaged together during the ensemble."
        ]
    },
    "CWPTBP": {
        "desc": [
          "CWPTBP n.nnn<CR>",
          "Water Profile Time Between Pings.  This is used to lengthen or shorten the average interval.",
          "Overall average time = CWPP * CWPTBP",
          "This overall average time should be less then CEI.",
          "",
          "n.nn = 0.00 to 86400.00 seconds (24 hours)",
          "Sets the time between the last ping, regardless of ping type, and the next profile ping."
        ]
    },
    "CWPRT": {
        "desc": [
          "CWPRT m,n1,n2<CR>",
          "Water Ping Range Tracking. Search for the surface or bottom. ",
          "When enabled the system locates the highest ",
          "amplitude signal in the water profile amplitude data. The system uses very high ",
          "resolution sample data to give precise range to the target. The range data is ",
          "useful for non-directional wave height and bottom depth sounding. ",
          "",
          "Note: You need to setup the profile to collect more bins than the expected ",
          "maximum range to the surface.",
          "1. Mode m",
          "   a. 0 = OFF.",
          "   b. 1 = ON and use n1 and n2 for the first and last bin to look between for a valid amplitude target. Search window is between bins n1 and n2.",
          "   c. 2 = ON and use n1 as a fraction of the range before and after the depth as measured by the pressure sensor. Search window = depth*(1-n1) to depth*(1+n1).",
          "2. n1, n2 supporting parameters for the tracking mode."
        ]
    },
    "CBTON": {
        "desc": [
          "CBTON n<CR>",
          "Bottom Track ON. Enables or disables bottom track pings.",
          "",
          "1. n = 0 disable bottom tracking. Allows for more water profile pings per second and saves battery energy ",
          " during self-contained deployments.",
          "2. n = 1 enable bottom tracking. When enabled a bottom track ping occurs once per ensemble. Or, when ",
          "profiling is enabled, a bottom track ping occurs at the beginning of the ensemble and then after every ",
          "10 profile pings in the ensemble. If there are less than 10 profile pings per ensemble the bottom track ",
          "ping will only occur once at the beginning of the ensemble."
        ]
    },
    "CBTBB": {
        "desc": [
          "CBTBB mode, p to p lag, LR depth, beam mux<CR>",
          "Bottom Track BB control.",
          "Mode",
          "   0 = Narrowband long range. Maximum velocity 11 m/s 20 degree beam angle, 7 m/s for a 30 degree.",
          "   1 = Broadband coded transmit. Maximum velocity 13 m/s 20 degree beam angle, 9 m/s for a 30 degree.",
          "   2 = Broadband non-coded transmit. Maximum velocity 22 m/s 20 degree beam angle, 15 m/s for a 30 degree.",
          "   3 = NA.",
          "   4 = Broadband non-code pulse to pulse. Maximum velocity dependent on lag length.",
          "   5 = NA.",
          "   6 = NA.",
          "   7 = Auto Switch between n = 0, n = 2, and n = 4.",
          " ",
          "Pulse-to-Pulse Lag(m)",
          "   Lag length in vertical meters. When enabled bottom track will use pulse-to-pulse transmit and processing at depths ",
          "   less than 1/2 the lag length. Allows for near bottom ultra low variance velocity measurements.",
          " ",
          "Long Range depth (m).",
          "   The range in meters beyond which the bottom track will switch to narrowband long range processing when n = 7.",
          " ",
          "Beam Multiplex",
          "   1 = ping and process each beam one at a time.",
          "   2 = ping and process beam pairs.",
          "   4 = ping and process all four beams together."
        ]
    },
    "CBTTBP": {
        "desc": [
          "CBTTBP n.nn<CR>",
          "Bottom Track Time Between Pings. ",
          "The Bottom Track ping may be seen in the Water Profile Ping.",
          "This time allows the Bottom Track Ping to dissipate before the next Water Profile Ping.",
          "",
          "n.nn = 0.00 to 86400.00 seconds (24 hours) sets the time between the last ping, regardless of ping type, and the next bottom ping."
        ]
    },
    "CBI": {
        "desc": [
          "CBI HH:MM:SS.hh,n,m,o<CR>",
          "Burst Interval. Used when a precise short time interval is ",
          "required between ensembles followed by a period of sleep.",
          "",
          "HH:MM:SS.hh = The time interval between a series of ensembles.",
          "",
          "n = The number of ensembles that are output during each burst. The time between each ensemble is controlled by the CEI command.",
          "",
          "m = Sets the Burst Group number. 0 = no grouping, n = 1 to 15 the next n",
          "       sub systems will be interleaved (alternating pings) with the current sub ",
          "       system during the burst. The CBI commands for each subsystem in a",
          "       group should be set to the same value(s). If subsystems are grouped ",
          "       together the time between ensembles will be CEI / (n+1).",
          "",
          "o = Set the Burst ID.  This will used to group ensembles together.  Some bursts",
          "       maybe only used for water current measurements and not waves measurements",
          "       but later want to be grouped together.  Used the same Burst ID for all the",
          "       bursts that you want to group together.  If you interleave a 4 beam and vertical",
          "       beam, then group the bursts together with the same Burst ID.",
          "",
          "Note: Burst sampling typically requires precise timing intervals. If serial data output is enabled during burst sampling the user needs to ensure",
          "that each data transfer completes before the next ensemble is output. If the length of the data transfer exceeds the time between samples the data",
          "will bottleneck and the desired sample rate will not be maintained. Self-contained ADCP users can disable the serial data output by sending the",
          "command CEOUTPUT 0<CR>. Of course you need to enable the internal data recording CERECORD 1<CR>. During burst sampling, internal data recording",
          "only occurs at the end of the burst or when the STOP<CR> command is received by the ADCP. Another option, when real-time data is required,",
          "to increase the data output rate use the C485B 921600<CR> or C422B 921600<CR> command. Be aware that the RS232 connection may not",
          "reliably support the higher data rates."
        ]
    },
    "CEI": {
      "desc": [
        "CEI HH:MM:SS.hh<CR> ",
        "Ensemble Interval.",
        "",
        "Sets the time interval that system will output the averaged profile/bottom track data.",
        "Note:",
        "All digits including the space following CEI and the separators must be part of the command or the system will reject it."
      ]
    },
    "CERECORD": {
        "desc": [
          "CERECORD n,m<CR>",
          "n=Ensemble Recording 0=disable, 1=enable.",
          "m=SinglePing Recording 0=disable, 1=enable.",
          "   1. When ensemble recording is enabled and the ADCP is started (START<CR>) the firmware searches for the next available file number to record",
          "      to on the SD card. The ensemble file name starts with the letter (A) followed by a 7 digit number and ending with the extension (.ens).",
          "      For example: The first ensemble file will be named (A0000001.ens). During deployment as each ensemble is completed the data is appended",
          "      to the current file. The 7 digit number following the (A) is incremented each time the system is (re)started or when the file size exceeds",
          "      16Mbytes bytes.",
          "",
          "      Note: Internal ensemble data recording during burst sampling only occurs at the end of the burst.",
          "",
          "   2. When single recording is enabled and the ADCP is started (START<CR>) the firmware searches for the next available file number to record to",
          "      on the SD card. The single ping file name starts with the letter (S) followed by a 7 digit number and ending with the extension (.ens).",
          "      For example: The first single ping file will be named (S0000001.ens). During deployment as each ping is completed the data is appended to",
          "      the current file. The 7 digit number following the (S) is incremented each time the system is (re)started or when the file size exceeds",
          "      16Mbytes bytes. Each ping, whether bottom track or profile, is considered to be a single ping.",
          "",
          "      Note: No error/ threshold screening or coordinate transformation is performed on the data contained in a single ping file."
        ]
    },
    "CWS": {
        "desc": [
          "CWS n.nnn<CR>",
          "Water Salinity (ppt). ",
          "",
          "Typical Values:",
          "Salt Water:          35 ppt",
          "Fresh Water:       0 ppt",
          "Estuary Water:   15 ppt",
          "",
          "Used in the water speed of sound calculation."
        ]
    },
    "CWT": {
      "desc": [
        "CWT n.nnn<CR>",
        "Water Temperature (degrees celsius). Used in the water speed of sound calculation if the temperature sensor is not available. ",
        "",
        "Used in the water speed of sound calculation."
      ]
    },
    "CTD": {
      "desc": [
        "CTD n.nnn<CR>",
        "Transducer Depth in (meters).",
        "",
        "Used in the water speed of sound calculation."
      ]
    },
    "CWSS": {
      "desc": [
        "CWSS n.nnn<CR>",
        "Water Speed of Sound (meters per second).",
        "",
        "If the speed of sound source is set to sensor or command i.e. CWSSCx,x,x,0<CR> or CWSSCx,x,x,1<CR>,",
        "during standby and pinging the firmware monitors the communication ports for changes in CWSS and ",
        "for the NMEA strings: $AML,SVM,SS,SN,nn*cs and/or $DVLSET, SS*cs. These NMEA strings are used on ",
        "the Ocean Server platform for speed of sound input. When the ADCP/DVL detects a valid speed of sound ",
        "NMEA string it automatically sets the CWSSC speed of sound source to 0 (command)."
      ]
    },
    "CEOUTPUT": {
      "desc": [
        "CEOUTPUT n, c<CR>",
        "Ensemble output type.",
        "n = 0",
        "Disables serial output. Saves battery energy when recording data",
        "to the SD card during a self-contained deployment by reducing extra on ",
        "time of the system due to data transfer.",
        "n = 1",
        "Enables the RoweTech binary output data protocol to be sent out",
        "the serial port when the system is in PROFILE mode. If the system is in ",
        "DVL mode the $PRTI01 $PRTI02 $PRTI30 $PRTI31 data strings are ",
        "output.",
        "n = 2",
        "Enables an ASCII text serial output that is dumb terminal ",
        "compatible to be sent out the serial port when the system is in PROFILE ",
        "mode. If the system is in DVL mode the $PRTI01 $PRTI02 $PRTI32 ",
        "$PRTI33 data strings are output.",
        "n = 3",
        "Disables all output except for a NMEA status string. Allows the user",
        "to verify that the instrument is operating normally while recording data",
        "to the internal recorder. Saves power and can improve ping timing.",
        "n = 4",
        "Enable the special Ocean Server NMEA DVL data output. When ",
        "CEOUTPUT 4 is selected a second parameter can be sent to select the",
        "navigation bin. CEOUTPUT 4, b<CR> where b is the profile bin that will",
        "be used in the $DVLNAV string.",
        "n = 5",
        "If the system is in DVL mode the $PRTI03 data string is output",
        "n = 100, c",
        "Selects PD0 binary output. When CEOUTPUT 100 is selected a ",
        "second parameter can be sent to select the velocity coordinate system. ",
        "c = 0 is Beam coordinates transform",
        "c = 1 is Instrument (XYZ)",
        "c = 2 is Earth (ENU)",
        "c = 3 is Ship (SFM)",
        "n = 103, c",
        "Selects PD3 binary output. When CEOUTPUT 103 is selected a",
        "second parameter can be sent to select the velocity coordinate system.",
        "n = 104, c",
        "Selects PD4 binary output. When CEOUTPUT 104 is selected a",
        "second parameter can be sent to select the velocity coordinate system.",
        "n = 105, c",
        "Selects PD5 binary output. When CEOUTPUT 105 is selected a",
        "second parameter can be sent to select the velocity coordinate system.",
        "n = 106",
        "Selects PD6 ASCII output.",
        "n = 113",
        "Selects PD13 ASCII output."
      ]
    },
    "CED": {
        "desc": [
          "CED ABCDEFGHIJKLMNOPQsssssssssssssss<CR>",
          "Enable Data. Enable/Disable each binary data type.",
          "A one (1) enables the binary data type to be output in the RoweTech structure. A zero (0) disables it.",
          "",
          "1. A = E000001 = beam velocity profile",
          "2. B = E000002 = instrument profile",
          "3. C = E000003 = earth profile",
          "4. D = E000004 = Amplitude profile",
          "5. E = E000005 = correlation profile",
          "6. F = E000006 = beamN",
          "7. G = E000007 = xfrmN",
          "8. H = E000008 = EnsembleData",
          "9. I = E000009 = Ancillary",
          "10. J = E000010 = Bottom Track",
          "11. K = E000011 = NMEA",
          "12. L = E000012 = EngProfileData",
          "13. M = E000013 = EngBottomData",
          "14. N = E000014 = System Transmit Settings",
          "15. O = E000015 = BT on WP",
          "16. P = E000016 = Gage Height",
          "17. Q = E000017 = ADCP2 Info",
          "18. s = Spare"
        ]
    },
    "Setups": {
      "Default": {
        "1200": {
          "CWPON": true,
          "CWPBL": 0.4,
          "CWPBS": 1.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.02,
          "CWPP": 1,
          "CWPTBP": 0.13,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.05,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "600": {
          "CWPON": true,
          "CWPBL": 0.8,
          "CWPBS": 2.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.4,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "300": {
          "CWPON": true,
          "CWPBL": 1.6,
          "CWPBS": 4.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.8,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        }
      },
      "WM1": {
        "1200": {
          "CWPON": true,
          "CWPBL": 0.23,
          "CWPBS": 0.25,
          "CWPBN": 80,
          "CWPBB_Lag": 0.06,
          "CWPP": 1,
          "CWPTBP": 0.13,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.05,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "600": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 0.5,
          "CWPBN": 120,
          "CWPBB_Lag": 0.13,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "300": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 1.0,
          "CWPBN": 130,
          "CWPBB_Lag": 0.25,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        }
      },
      "WM5": {
        "1200": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 0.05,
          "CWPBN": 80,
          "CWPBB_Lag": 1.3,
          "CWPP": 1,
          "CWPTBP": 0.13,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.05,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "600": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 0.1,
          "CWPBN": 80,
          "CWPBB_Lag": 1.3,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "300": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 0.2,
          "CWPBN": 80,
          "CWPBB_Lag": 2.6,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        }
      },
      "WM8": {
        "1200": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 0.05,
          "CWPBN": 80,
          "CWPBB_Lag": 0.32,
          "CWPP": 1,
          "CWPTBP": 0.13,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.05,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "600": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 0.1,
          "CWPBN": 80,
          "CWPBB_Lag": 0.65,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "300": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 0.2,
          "CWPBN": 80,
          "CWPBB_Lag": 1.3,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        }
      },
      "Seafloor": {
        "1200": {
          "CWPON": true,
          "CWPBL": 0.4,
          "CWPBS": 1.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.2,
          "CWPP": 1,
          "CWPTBP": 0.13,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.05,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 2,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "600": {
          "CWPON": true,
          "CWPBL": 0.8,
          "CWPBS": 2.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.4,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 2,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "300": {
          "CWPON": true,
          "CWPBL": 1.6,
          "CWPBS": 4.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.8,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 2,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        }
      },
      "MovingBoat": {
        "1200": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 1.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.13,
          "CWPP": 1,
          "CWPTBP": 0.13,
          "CBTON": true,
          "CBTBB": 7,
          "CBTTBP": 0.05,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "600": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 2.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.25,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": true,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "300": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 4.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.55,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": true,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        }
      },
      "Waves": {
        "1200": {
          "CWPON": true,
          "CWPBL": 0.1,
          "CWPBS": 0.5,
          "CWPBN": 40,
          "CWPBB_Lag": 0.30,
          "CWPP": 1,
          "CWPTBP": 0.13,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.05,
          "CBI_Enabled": true,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 2,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "600": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 0.5,
          "CWPBN": 80,
          "CWPBB_Lag": 0.65,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": true,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 2,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "300": {
          "CWPON": true,
          "CWPBL": 0.01,
          "CWPBS": 0.5,
          "CWPBN": 80,
          "CWPBB_Lag": 1.3,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": false,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": true,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 2,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        }
      },
      "DVL": {
        "1200": {
          "CWPON": false,
          "CWPBL": 0.01,
          "CWPBS": 1.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.13,
          "CWPP": 1,
          "CWPTBP": 0.13,
          "CBTON": true,
          "CBTBB": 7,
          "CBTTBP": 0.05,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "600": {
          "CWPON": false,
          "CWPBL": 0.01,
          "CWPBS": 2.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.25,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": true,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        },
        "300": {
          "CWPON": false,
          "CWPBL": 0.01,
          "CWPBS": 4.0,
          "CWPBN": 30,
          "CWPBB_Lag": 0.55,
          "CWPP": 1,
          "CWPTBP": 0.25,
          "CBTON": true,
          "CBTBB": 7,
          "CBTTBP": 0.13,
          "CBI_Enabled": false,
          "CBI_BusrtInterval": 3600.0,
          "CBI_NumEns": 1024,
          "CBI_Interleaved": false,
          "CWPRT_Mode": 0,
          "CWPRT_MinBin": 0,
          "CWPRT_MaxBin": 30,
          "CWPRT_Pressure": 0.5
        }
      },
      "UpwardFacing": {

      }
    }
}
